# Automatically generated by gen_test.py for:
# Verilog file bug7_reduced.v
# Top module: top

[gold]
read_verilog ../tests/verilog/bug7_reduced.v
prep -top top
rename -top design
splitcells
splitnets

[gate]
plugin -i libtamara.so
read_verilog -DTAMARA ../tests/verilog/bug7_reduced.v
prep -top top
rename -top design
splitcells
splitnets
tamara_tmr

[strategy sby]
use sby
depth 2
engine smtbmc yices

