# Automatically generated by gen_test.py for:
# Verilog file crc.v
# Top module: crc6

[gold]
read_verilog -sv ../tests/verilog/crc.v
prep -top crc6
rename -top design
splitcells
splitnets

[gate]
plugin -i libtamara.so
read_verilog -DTAMARA -sv ../tests/verilog/crc.v
prep -top crc6
rename -top design
splitcells
splitnets
tamara_tmr
opt_clean

[strategy sby]
use sby
depth 2
engine smtbmc yices

