# Automatically generated by gen_test.py for:
# Verilog file crc.v
# Top module: crc8

[gold]
read_verilog -sv ../tests/verilog/crc.v
prep -top crc8
rename -top design
splitcells
splitnets

[gate]
plugin -i libtamara.so
read_verilog -DTAMARA -sv ../tests/verilog/crc.v
prep -top crc8
rename -top design
splitcells
splitnets
tamara_tmr

[strategy sby]
use sby
depth 2
engine smtbmc yices

