# Automatically generated by gen_test.py for:
# Verilog file crc_min.sv
# Top module: crc_const_variant3

[gold]
read_verilog -sv ../tests/verilog/crc_min.sv
prep -top crc_const_variant3
rename -top design
splitcells
splitnets

[gate]
plugin -i libtamara.so
read_verilog -DTAMARA -sv ../tests/verilog/crc_min.sv
prep -top crc_const_variant3
rename -top design
splitcells
splitnets
tamara_tmr
opt_clean

[strategy sby]
use sby
depth 2
engine smtbmc yices

