# Automatically generated by gen_test.py for:
# Verilog file mux.sv
# Top module: mux_2bit

[gold]
read_verilog -sv ../tests/verilog/mux.sv
prep -top mux_2bit
rename -top design
splitcells
splitnets

[gate]
plugin -i libtamara.so
read_verilog -DTAMARA -sv ../tests/verilog/mux.sv
prep -top mux_2bit
rename -top design
splitcells
splitnets
tamara_tmr

[strategy sby]
use sby
depth 2
engine smtbmc yices

