# Test that checks that a simple circuit is equivalent when manually replicating elements and inserting a
# voter.

[gold]
read_verilog -sv ../tests/verilog/not_voter_manual_tmr.sv
prep -top inverter
flatten
rename -top design

[gate]
read_verilog -sv ../tests/verilog/voter.sv
read_verilog -sv ../tests/verilog/not_voter_manual_tmr.sv
prep -top not_voter_gate
flatten
rename -top design

[strategy sby]
use sby
depth 2
engine smtbmc yices
