# Tests that checks the not_2bit in "not_tmr.sv" circuit, which is a simple NOT gate, is equivalent
# before/after TaMaRa TMR

[gold]
read_verilog -sv ../tests/verilog/not_2bit.sv
prep -top not_2bit
rename -top design
splitcells
splitnets

[gate]
plugin -i libtamara.so
read_verilog -DTAMARA -sv ../tests/verilog/not_2bit.sv
prep -top not_2bit
rename -top design
splitcells
splitnets
tamara_tmr
opt_clean

[strategy sby]
use sby
depth 2
engine smtbmc yices

# [strategy sat]
# use sat
# depth 15
