# Tests that the "not_dff_tmr.sv" circuit, which is a simple DFF into a NOT gate, is equivalent before/after
# TaMaRa TMR

[gold]
read_verilog -sv ../tests/verilog/not_dff_tmr.sv
prep -top not_dff_tmr
flatten
rename -top design

[gate]
plugin -i libtamara.so
read_verilog -DTAMARA -sv ../tests/verilog/not_dff_tmr.sv
hierarchy -top not_dff_tmr
rename -top design
prep
tamara_tmr

[strategy sby]
use sby
depth 2
engine smtbmc yices
