# Automatically generated by gen_test.py for:
# Verilog file not_32bit.sv
# Top module: not_32bit

[gold]
read_verilog -sv ../tests/verilog/not_32bit.sv
prep -top not_32bit
rename -top design
splitcells
splitnets

[gate]
plugin -i libtamara.so
read_verilog -DTAMARA -sv ../tests/verilog/not_32bit.sv
prep -top not_32bit
rename -top design
splitcells
splitnets
tamara_tmr

[strategy sby]
use sby
depth 2
engine smtbmc yices

