# This is the same as not_dff.eqy, except it writes the Verilog out and reads it back in again

[gold]
read_verilog -sv ../tests/verilog/not_dff_tmr.sv
prep -top not_dff_tmr
flatten
rename -top design

[gate]
plugin -i libtamara.so
read_verilog -DTAMARA -sv ../tests/verilog/not_dff_tmr.sv
hierarchy -top not_dff_tmr
rename -top design
prep
tamara_tmr
opt_clean

write_verilog /tmp/not_dff_e2e.v
design -reset

read_verilog /tmp/not_dff_e2e.v
prep

# [strategy sby]
# use sby
# depth 2
# engine smtbmc yices

[strategy sat]
use sat
depth 15
