# Automatically generated by gen_test.py for:
# Verilog file not_slice.sv
# Top module: not_slice

[gold]
read_verilog -sv ../tests/verilog/not_slices.sv
prep -top not_slice
rename -top design
splitcells
splitnets

[gate]
plugin -i libtamara.so
read_verilog -DTAMARA -sv ../tests/verilog/not_slices.sv
prep -top not_slice
rename -top design
splitcells
splitnets
tamara_tmr
opt_clean

[strategy sby]
use sby
depth 2
engine smtbmc yices

