# Tests that the "not_dff_tmr.sv" circuit, which is a simple DFF into a NOT gate, is equivalent before/after
# TaMaRa TMR

[gold]
read_verilog -sv ../tests/verilog/not_dff_tmr.sv
prep -top not_dff_tmr
setattr -set init 0 t:$dff
setundef -init -zero
flatten
rename -top design

[gate]
plugin -i libtamara.so
read_verilog -DTAMARA -sv ../tests/verilog/not_dff_tmr.sv
hierarchy -top not_dff_tmr
setundef -init -zero
rename -top design
prep
setattr -set init 0 t:$dff
tamara_tmr
opt_clean

# [strategy sby]
# use sby
# depth 15
# engine smtbmc yices

[strategy sat]
use sat
depth 15
