# Automatically generated by gen_test.py for:
# Verilog file: bug39.v
# Top module: bug39

plugin -i libtamara.so

read_verilog -sv ../tests/verilog/bug39.v
hierarchy -top bug39

prep
splitcells
splitnets
write_rtlil

tamara_tmr
opt_clean
check -assert
write_rtlil
write_verilog
show -colors 420

