# Automatically generated by gen_test.py for:
# Verilog file: bug31.v
# Top module: top

plugin -i libtamara.so

read_verilog -sv ../tests/verilog/bug31.v
hierarchy -top top

prep
splitcells
splitnets
write_rtlil

tamara_tmr
opt_clean
check -assert
write_rtlil
write_verilog
show -colors 420

