# Test for https://github.com/mattyoung101/tamara/issues/7
plugin -i libtamara.so

read_verilog ../tests/verilog/bug7_reduced.v

prep
splitcells
splitnets
show -colors 420

write_rtlil
tamara_tmr
check -assert

write_rtlil
