# Automatically generated by gen_test.py for:
# Verilog file: cones.sv
# Top module: cones_2bit

plugin -i libtamara.so

read_verilog -sv ../tests/verilog/cones.sv
hierarchy -top cones_2bit

prep
splitcells
splitnets
write_rtlil

tamara_tmr
check -assert
write_rtlil
write_verilog
show -colors 420

