# Automatically generated by gen_test.py for:
# Verilog file: cones.sv
# Top module: cones_min

plugin -i libtamara.so

read_verilog -sv ../tests/verilog/cones.sv
hierarchy -top cones_min

prep
splitcells
splitnets
write_rtlil

tamara_tmr
opt_clean
show -colors 420

check -assert
write_rtlil
write_verilog

