# Automatically generated by gen_test.py for:
# Verilog file: counter.sv
# Top module: top

plugin -i libtamara.so

read_verilog -sv ../tests/verilog/counter.sv
hierarchy -top top

prep
splitcells
splitnets
flatten
write_rtlil

tamara_tmr
check
write_rtlil
write_verilog
show -colors 420

