# Automatically generated by gen_test.py for:
# Verilog file: clz.v
# Top module: count_leading_zero
# !! MODIFIED !!

plugin -i libtamara.so

read_verilog ../tests/verilog/clz.v
hierarchy -top count_lead_zero

prep
splitcells
splitnets
flatten
write_rtlil

tamara_tmr
opt_clean
check -assert
write_rtlil
write_verilog
show -colors 420

