# Automatically generated by gen_test.py for:
# Verilog file: crc.v
# Top module: crc16

plugin -i libtamara.so

read_verilog -sv ../tests/verilog/crc.v
hierarchy -top crc16

prep
splitcells
splitnets
write_rtlil

tamara_tmr
check
write_rtlil
write_verilog
show -colors 420

