# Tests end to end TaMaRa for a CRC2 calculator

plugin -i libtamara.so

read_verilog ../tests/verilog/crc.v
hierarchy -top crc2

prep
splitcells
splitnets
write_rtlil
tamara_tmr
check -assert

write_rtlil
show -colors 420
