# Tests end to end TaMaRa for a CRC2 calculator

plugin -i libtamara.so

read_verilog ../tests/verilog/crc2.v
hierarchy -top crc

prep
write_rtlil
tamara_tmr
check

write_rtlil
show -colors 420
