# Automatically generated by gen_test.py for:
# Verilog file: crc.v
# Top module: crc7

plugin -i libtamara.so

read_verilog -sv ../tests/verilog/crc.v
hierarchy -top crc7

prep
splitcells
splitnets
write_rtlil

tamara_tmr
check -assert
write_rtlil
write_verilog
show -colors 420

