# Tests end to end TaMaRa for a CRC8 calculator

plugin -i libtamara.so

read_verilog ../tests/verilog/crc.v
hierarchy -top crc8

prep
splitcells
splitnets
write_rtlil
tamara_tmr
opt_clean
check -assert

write_rtlil
show -colors 420
