# Automatically generated by gen_test.py for:
# Verilog file: crc_min.sv
# Top module: crc_const_variant4

plugin -i libtamara.so

read_verilog -sv ../tests/verilog/crc_min.sv
hierarchy -top crc_const_variant4

prep
splitcells
splitnets
write_rtlil

tamara_tmr
check -assert
write_rtlil
write_verilog
show -colors 420

