# Automatically generated by gen_test.py for:
# Verilog file: crc_min.sv
# Top module: crc_min

plugin -i libtamara.so

read_verilog -sv ../tests/verilog/crc_min.sv
hierarchy -top crc_min

prep
splitcells
splitnets
write_rtlil
# show -colors 420 -pause

tamara_tmr
check
write_rtlil
write_verilog
show -colors 420

