# Tests applying end to end TMR to a simple circuit with a  DFF.

plugin -i libtamara.so

read_verilog -sv ../tests/verilog/dff_tmr.sv
hierarchy -top dff_tmr

prep
check
write_rtlil

tamara_tmr
opt_clean
check -assert
write_rtlil
show -colors 420 -color darkgreen a:tamara_cone=0 -color blue a:tamara_cone=1 -color purple a:tamara_cone=2 -color coral a:tamara_cone=3 -color darkcyan a:tamara_cone=4 -color darksalmon a:tamara_cone=5 -color mistyrose a:tamara_cone=6 -color red a:tamara_cone=7
