# Tests applying end to end TMR to a simple circuit with a  DFF.

plugin -i libtamara.so

read_verilog -sv ../tests/verilog/dff_tmr.sv
hierarchy -top dff_tmr

prep
check
write_rtlil

tamara_tmr
opt_clean
check -assert
write_rtlil
# write_verilog
show -colors 420
