# Automatically generated by gen_test.py for:
# Verilog file: divider.sv
# Top module: divider

plugin -i libtamara.so

read_verilog -sv ../tests/verilog/divider.sv
hierarchy -top divider

prep
splitcells
splitnets
write_rtlil

tamara_tmr
check
write_rtlil
write_verilog
show -colors 420

