# Test inserting one voter into a blank circuit

plugin -i libtamara.so
tamara_debug mkvoter 1
write_rtlil
#write_verilog
#write_cxxrtl
check -assert
show -colors 420

