# Automatically generated by gen_test.py for:
# Verilog file: memory.sv
# Top module: memory

plugin -i libtamara.so

read_verilog -sv ../tests/verilog/memory.sv
hierarchy -top memory

prep
splitcells
splitnets
write_rtlil

tamara_tmr
check
write_rtlil
write_verilog
show -colors 420

