# Automatically generated by gen_test.py for:
# Verilog file: memory.sv
# Top module: memory_simple

plugin -i libtamara.so

read_verilog -sv ../tests/verilog/memory.sv
hierarchy -top memory_simple

prep
splitcells
splitnets
write_rtlil

tamara_tmr
opt_clean
check -assert
write_rtlil
write_verilog
show -colors 420

