# Tests end to end TaMaRa for the minimax RV32 CPU

plugin -i libtamara.so

read_verilog ../tests/verilog/minimax.v
hierarchy -top minimax

prep
write_rtlil
tamara_tmr
opt_clean
check

write_rtlil
