# Automatically generated by gen_test.py for:
# Verilog file: mux.sv
# Top module: mux_1bit

plugin -i libtamara.so

read_verilog -sv ../tests/verilog/mux.sv
hierarchy -top mux_1bit

prep
splitcells
splitnets
write_rtlil

tamara_tmr
check
write_rtlil
write_verilog
show -colors 420

