# Automatically generated by gen_test.py for:
# Verilog file: mux.sv
# Top module: mux_32bit

plugin -i libtamara.so

read_verilog -sv ../tests/verilog/mux.sv
hierarchy -top mux_32bit

prep
splitcells
splitnets
write_rtlil

tamara_tmr
opt_clean
check -assert
write_rtlil
write_verilog
show -colors 420

