# Tests applying end to end TMR to a simple NOT gate circuit WITH a DFF.

plugin -i libtamara.so

read_verilog -sv ../tests/verilog/not_dff_tmr.sv
hierarchy -top not_dff_tmr
tamara_propagate

prep
check
write_rtlil

tamara_tmr
check
write_rtlil
show -colors 420
