# Tests applying end to end TMR to a simple NOT gate circuit.

plugin -i libtamara.so

read_verilog -sv ../tests/verilog/not_voter_eqy.sv
hierarchy -top inverter
tamara_propagate

prep
check
write_rtlil

tamara_tmr
check
write_rtlil
show -colors 420
