read_verilog -sv ../tests/verilog/voter.sv
read_verilog -sv ../tests/verilog/not_voter_eqy.sv
prep -top not_voter_gate

flatten
write_rtlil
write_verilog
show
