read_verilog -sv ../tests/verilog/voter.sv
read_verilog -sv ../tests/verilog/not_voter.sv
hierarchy -top not_voter
flatten
prep -top not_voter
write_rtlil
write_verilog
show
