# Tests applying end to end TMR to a simple NOT gate circuit WITH a DFF.

plugin -i libtamara.so

read_verilog -sv ../tests/verilog/not_2bit.sv
hierarchy -top not_2bit

prep
splitcells
splitnets
write_rtlil

tamara_tmr
opt_clean
check -assert
write_rtlil
write_verilog
show -colors 420 #-long
