# Tests applying end to end TMR to a simple NOT gate circuit.

plugin -i libtamara.so

read_verilog -DTAMARA -sv ../tests/verilog/not_tmr.sv
hierarchy -top inverter

prep
check
write_rtlil

tamara_tmr
opt_clean
check
write_rtlil
show -colors 420
