# Automatically generated by gen_test.py for:
# Verilog file: not_slices.sv
# Top module: not_slice

plugin -i libtamara.so

read_verilog -sv ../tests/verilog/not_slices.sv
hierarchy -top not_slice

prep
splitcells
splitnets
write_rtlil

tamara_tmr
opt_clean
check -assert
write_rtlil
write_verilog
show -colors 420 -long

