# Automatically generated by gen_test.py for:
# Verilog file: not_32bit.sv
# Top module: not_32bit

plugin -i libtamara.so

read_verilog -sv ../tests/verilog/not_32bit.sv
hierarchy -top not_32bit

prep
splitcells
splitnets
write_rtlil

tamara_tmr
opt_clean
check
write_rtlil
write_verilog
show -colors 420

