# Tests applying end to end TMR to a simple NOT gate circuit WITH a DFF.

plugin -i libtamara.so

read_verilog -DTAMARA -sv ../tests/verilog/not_dff_tmr.sv
hierarchy -top not_dff_tmr

prep
check
write_rtlil

tamara_tmr
opt_clean
check
write_rtlil
# write_verilog -norename
show -colors 420 -long -width
