# Tests end to end TaMaRa for the picorv32 CPU

plugin -i libtamara.so

read_verilog ../tests/verilog/picorv32.v
hierarchy -top picorv32

prep
splitcells
splitnets
tamara_tmr
opt_clean
check

write_rtlil
