# Tests end to end TaMaRa for the picorv32 CPU

plugin -i libtamara.so

read_verilog ../tests/verilog/picorv32.v
hierarchy -top picorv32
tamara_propagate
check

prep
tamara_propagate
tamara_tmr
check

write_rtlil
