# Automatically generated by gen_test.py for:
# Verilog file: recurrent_dff.sv
# Top module: recurrent_dff

plugin -i libtamara.so

read_verilog -sv ../tests/verilog/recurrent_dff.sv
hierarchy -top recurrent_dff

prep
splitcells
splitnets
write_rtlil

tamara_tmr
opt_clean
check -assert
write_rtlil
write_verilog
show -colors 420

