# Test case for Verismith; assumes data has already been read using read_verilog

plugin -i libtamara.so

hierarchy -top top

prep
splitcells
splitnets
tamara_tmr
opt_clean
check

