# Automatically generated by gen_test.py for:
# Verilog file: voter.sv
# Top module: voter

plugin -i libtamara.so

read_verilog -sv ../tests/verilog/voter.sv
hierarchy -top voter

prep
splitcells
splitnets
write_rtlil

tamara_tmr
opt_clean
check
write_rtlil
write_verilog
show -colors 420

